{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 1, 750, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "padding": "valid", "activation": "relu", "filters": 50, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [1, 15], "kernel_regularizer": null, "strides": [1, 15], "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_3", "pool_size": [1, 1], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "padding": "valid", "activation": "relu", "filters": 30, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_4", "pool_size": [1, 1], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"trainable": true, "units": 50, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 4, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}}, "class_name": "Dense"}], "keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential"}