{"backend": "tensorflow", "keras_version": "2.0.3", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "kernel_size": [1, 15], "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 15], "kernel_constraint": null, "batch_input_shape": [null, 1, 750, 1], "dtype": "float32", "use_bias": true, "name": "conv2d_9", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "filters": 50}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 1], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_9", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "relu", "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "name": "conv2d_10", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "filters": 30}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 1], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_10", "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 50, "use_bias": true, "name": "dense_9", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 4, "use_bias": true, "name": "dense_10", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}}}]}